---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetApplicationMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application)
source: html/2a2a21df-26ac-0ed2-c154-d58c615e7cbf.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetApplicationMacroSecurityOptions Method

Gets the application macro security options.

## Syntax (C#)
```csharp
public static ApplicationMacroOptions GetApplicationMacroSecurityOptions(
	Application application
)
```

## Parameters
- **application** (`Autodesk.Revit.ApplicationServices.Application`) - The application.

## Returns
Returns the application macro security options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null